Catalogs/КИИ_ЭкспертыИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КИИ_ЭкспертыИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КИИ_МоделиИИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЭксперта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>MCP</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КИИ_MCPСерверы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КИИ_ИнструментыИИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/КИИ_Чат/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// SPDX-License-Identifier: MIT
// Copyright (c) 2026 Андриянов Роман (Androman.pro)
// https://opensource.org/license/mit
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиHTTPСервиса

Функция ПингGET(Запрос)
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("ok", Истина);
	ДанныеОтвета.Вставить("service", "КИИ_Чат");
	ДанныеОтвета.Вставить("version", Метаданные.Версия);
	
	Возврат ОтветJSON(200, ДанныеОтвета);
	
КонецФункции

Функция ЭкспертыGET(Запрос)
	
	СписокЭкспертов = Новый Массив;
	
	ЗапросЭкспертов = Новый Запрос;
	ЗапросЭкспертов.Текст =
		"ВЫБРАТЬ
		|	КИИ_ЭкспертыИИ.Код КАК Код,
		|	КИИ_ЭкспертыИИ.Наименование КАК Наименование,
		|	КИИ_ЭкспертыИИ.Модель КАК Модель,
		|	ПРЕДСТАВЛЕНИЕ(КИИ_ЭкспертыИИ.Модель) КАК МодельПредставление
		|ИЗ
		|	Справочник.КИИ_ЭкспертыИИ КАК КИИ_ЭкспертыИИ
		|ГДЕ
		|	НЕ КИИ_ЭкспертыИИ.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	Выборка = ЗапросЭкспертов.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Элемент = Новый Структура;
		Элемент.Вставить("code", Выборка.Код);
		Элемент.Вставить("name", Выборка.Наименование);
		Элемент.Вставить("model", Выборка.МодельПредставление);
		Элемент.Вставить("hasModel", ЗначениеЗаполнено(Выборка.Модель));
		
		СписокЭкспертов.Добавить(Элемент);
		
	КонецЦикла;
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("ok", Истина);
	ДанныеОтвета.Вставить("experts", СписокЭкспертов);
	
	Возврат ОтветJSON(200, ДанныеОтвета);
	
КонецФункции

Функция СообщениеPOST(Запрос)
	
	Попытка
		ТелоЗапроса = ПрочитатьТелоJSON(Запрос);
	Исключение
		Возврат ОтветОшибки(400, НСтр("ru = 'Некорректный JSON в теле запроса'"), "");
	КонецПопытки;
	
	ИмяЭксперта = СтрокаСвойства(ТелоЗапроса, "expert");
	Если ПустаяСтрока(ИмяЭксперта) Тогда
		ИмяЭксперта = СтрокаСвойства(ТелоЗапроса, "эксперт");
	КонецЕсли;
	
	ТекстСообщения = СтрокаСвойства(ТелоЗапроса, "message");
	Если ПустаяСтрока(ТекстСообщения) Тогда
		ТекстСообщения = СтрокаСвойства(ТелоЗапроса, "сообщение");
	КонецЕсли;
	
	ИдентификаторСессии = СтрокаСвойства(ТелоЗапроса, "sessionId");
	Если ПустаяСтрока(ИдентификаторСессии) Тогда
		ИдентификаторСессии = СтрокаСвойства(ТелоЗапроса, "session_id");
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяЭксперта) Тогда
		Возврат ОтветОшибки(400, НСтр("ru = 'Не указан эксперт (поле expert)'"), ИдентификаторСессии);
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат ОтветОшибки(400, НСтр("ru = 'Не указано сообщение (поле message)'"), ИдентификаторСессии);
	КонецЕсли;
	
	Эксперт = НайтиЭксперта(ИмяЭксперта);
	Если Не ЗначениеЗаполнено(Эксперт) Тогда
		Возврат ОтветОшибки(
			404,
			СтрШаблон(НСтр("ru = 'Эксперт не найден: %1'"), ИмяЭксперта),
			ИдентификаторСессии);
	КонецЕсли;
	
	РеквизитыЭксперта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Эксперт, "Модель, ОписаниеЭксперта, Наименование");
	Если Не ЗначениеЗаполнено(РеквизитыЭксперта.Модель) Тогда
		Возврат ОтветОшибки(
			400,
			СтрШаблон(НСтр("ru = 'У эксперта ""%1"" не заполнена модель'"), РеквизитыЭксперта.Наименование),
			ИдентификаторСессии);
	КонецЕсли;
	
	СтруктураПромпта = Новый Структура;
	СтруктураПромпта.Вставить("СистемныйПромпт",
		Строка(РеквизитыЭксперта.ОписаниеЭксперта) + КИИ_КоннекторИИ.КонтекстТекущегоПользователя());
	СтруктураПромпта.Вставить("ПользовательскийПромпт", ТекстСообщения);
	СтруктураПромпта.Вставить("ИсторияСообщений", ИсторияИзТелаЗапроса(ТелоЗапроса));
	
	Инструменты = КИИ_КоннекторИИ.ИнструментыЭксперта(Эксперт);
	
	Если Инструменты.Количество() > 0 Тогда
		РезультатЗапроса = КИИ_КоннекторИИ.ЗапросКМоделиСИнструментами(
			РеквизитыЭксперта.Модель, СтруктураПромпта, Инструменты);
	Иначе
		РезультатЗапроса = КИИ_КоннекторИИ.ЗапросКМодели(
			РеквизитыЭксперта.Модель, СтруктураПромпта);
	КонецЕсли;
	
	Если РезультатЗапроса.ЭтоОшибка Тогда
		Возврат ОтветОшибки(502, РезультатЗапроса.ТекстОшибки, ИдентификаторСессии, РезультатЗапроса);
	КонецЕсли;
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("ok", Истина);
	ДанныеОтвета.Вставить("sessionId", ИдентификаторСессии);
	ДанныеОтвета.Вставить("expert", РеквизитыЭксперта.Наименование);
	ДанныеОтвета.Вставить("answer", РезультатЗапроса.ТекстОтвета);
	ДанныеОтвета.Вставить("error", "");
	ДанныеОтвета.Вставить("meta", МетаданныеОтвета(РезультатЗапроса));
	
	Возврат ОтветJSON(200, ДанныеОтвета);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиЭксперта(Знач ИмяИлиКод)
	
	Эксперт = Справочники.КИИ_ЭкспертыИИ.НайтиПоНаименованию(ИмяИлиКод, Истина);
	Если ЗначениеЗаполнено(Эксперт) Тогда
		Возврат Эксперт;
	КонецЕсли;
	
	Возврат Справочники.КИИ_ЭкспертыИИ.НайтиПоКоду(ИмяИлиКод);
	
КонецФункции

Функция ИсторияИзТелаЗапроса(ТелоЗапроса)
	
	Результат = Новый Массив;
	
	История = ЗначениеСвойства(ТелоЗапроса, "history");
	Если История = Неопределено Тогда
		История = ЗначениеСвойства(ТелоЗапроса, "история");
	КонецЕсли;
	
	Если ТипЗнч(История) <> Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ЭлементИстории Из История Цикл
		
		Роль = СтрокаСвойства(ЭлементИстории, "role");
		Если ПустаяСтрока(Роль) Тогда
			Роль = СтрокаСвойства(ЭлементИстории, "роль");
		КонецЕсли;
		
		Текст = СтрокаСвойства(ЭлементИстории, "content");
		Если ПустаяСтрока(Текст) Тогда
			Текст = СтрокаСвойства(ЭлементИстории, "text");
		КонецЕсли;
		Если ПустаяСтрока(Текст) Тогда
			Текст = СтрокаСвойства(ЭлементИстории, "текст");
		КонецЕсли;
		
		Если ПустаяСтрока(Роль) Или ПустаяСтрока(Текст) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Роль <> "user" И Роль <> "assistant" И Роль <> "system" Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаИстории = Новый Структура;
		СтрокаИстории.Вставить("Роль", Роль);
		СтрокаИстории.Вставить("Текст", Текст);
		Результат.Добавить(СтрокаИстории);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция МетаданныеОтвета(РезультатЗапроса)
	
	Мета = Новый Структура;
	Мета.Вставить("tokensIn", РезультатЗапроса.ВходныеТокены);
	Мета.Вставить("tokensOut", РезультатЗапроса.ВыходныеТокены);
	Мета.Вставить("tokensTotal", РезультатЗапроса.ВсегоТокенов);
	Мета.Вставить("seconds", РезультатЗапроса.ВремяОтветаСекунд);
	Мета.Вставить("model", РезультатЗапроса.МодельОтвета);
	Мета.Вставить("finishReason", РезультатЗапроса.ПричинаЗавершения);
	Мета.Вставить("requestId", РезультатЗапроса.IDЗапроса);
	Мета.Вставить("logId", Строка(РезультатЗапроса.Идентификатор));
	Мета.Вставить("toolCalls", РезультатЗапроса.БылиВызовыИнструментов);
	Мета.Вставить("iterations", РезультатЗапроса.КоличествоИтераций);
	
	Возврат Мета;
	
КонецФункции

Функция ПрочитатьТелоJSON(Запрос)
	
	Тело = Запрос.ПолучитьТелоКакСтроку();
	Если ПустаяСтрока(Тело) Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.JSONВЗначение(Тело, , Ложь);
	
КонецФункции

Функция ОтветОшибки(КодСостояния, ТекстОшибки, ИдентификаторСессии = "", РезультатЗапроса = Неопределено)
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("ok", Ложь);
	ДанныеОтвета.Вставить("sessionId", ИдентификаторСессии);
	ДанныеОтвета.Вставить("answer", "");
	ДанныеОтвета.Вставить("error", ТекстОшибки);
	
	Если РезультатЗапроса <> Неопределено Тогда
		ДанныеОтвета.Вставить("meta", МетаданныеОтвета(РезультатЗапроса));
	Иначе
		ДанныеОтвета.Вставить("meta", Новый Структура);
	КонецЕсли;
	
	Возврат ОтветJSON(КодСостояния, ДанныеОтвета);
	
КонецФункции

Функция ОтветJSON(КодСостояния, ДанныеОтвета)
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(
		ОбщегоНазначения.ЗначениеВJSON(ДанныеОтвета),
		КодировкаТекста.UTF8,
		ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;
	
КонецФункции

Функция ЗначениеСвойства(Объект, ИмяСвойства)
	
	Если Объект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("Структура") Тогда
		
		Значение = Неопределено;
		Если Объект.Свойство(ИмяСвойства, Значение) Тогда
			Возврат Значение;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("Соответствие") Тогда
		Возврат Объект.Получить(ИмяСвойства);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СтрокаСвойства(Объект, ИмяСвойства)
	
	Значение = ЗначениеСвойства(Объект, ИмяСвойства);
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СокрЛП(Строка(Значение));
	
КонецФункции

#КонецОбласти
